vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1166_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MIMXRT1166_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MIMXRT1166</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.06.00" date="2025-06-24">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version="25.03.00" date="2025-03-28">NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version="19.0.0" date="2024-07-17">NXP CMSIS Packs based on MCUXpresso SDK 2.16.0</release>
    <release version="18.0.0" date="2024-01-14">NXP CMSIS Packs based on MCUXpresso SDK 2.15.0</release>
    <release version="17.0.0" date="2023-07-27">NXP CMSIS Packs based on MCUXpresso SDK 2.14.0</release>
    <release version="16.0.0" date="2023-01-16">NXP CMSIS Packs based on MCUXpresso SDK 2.13.0</release>
    <release version="15.1.0" date="2022-09-28">NXP CMSIS Packs based on MCUXpresso SDK 2.12.1</release>
    <release version="15.0.0" date="2022-07-13">NXP CMSIS Packs based on MCUXpresso SDK 2.12.0</release>
    <release version="14.0.0" date="2022-01-05">NXP CMSIS Packs based on MCUXpresso SDK 2.11.0</release>
    <release version="13.1.0" date="2021-07-13">NXP CMSIS Packs based on MCUXpresso SDK 2.10.0</release>
    <release version="13.0.0" date="2021-05-14">NXP CMSIS Packs based on MCUXpresso SDK 2.9.0</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MIMXRT1166" Dvendor="NXP:11">
      <description>
        i.MX RT1160 Crossover MCU Family - High-performance MCU with Arm® Cortex®-M7 and Cortex-M4 Cores
      </description>
      <device Dname="MIMXRT1166xxxxx">
        <processor Pname="cm4" Dcore="Cortex-M4" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="240000000"/>
        <processor Pname="cm7" Dcore="Cortex-M7" Dfpu="DP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="600000000"/>
        <environment Pname="cm4" name="iar">
          <file category="linkerfile" name="devices/MIMXRT1166/iar/MIMXRT1166xxxxx_cm4_ram.icf"/>
        </environment>
        <environment Pname="cm7" name="iar">
          <file category="linkerfile" name="devices/MIMXRT1166/iar/MIMXRT1166xxxxx_cm7_ram.icf"/>
        </environment>
        <sequences>
          <sequence name="dpstart">
            <block>
              __var SW_DP_ABORT  = 0x0;
              __var DP_CTRL_STAT = 0x4;
              __var DP_SELECT    = 0x8;
              __var powered_down = 0;
              __var select = 0;
            </block>
            <control if="__ap==1">
              <block>select = 0x01000000;</block>
            </control>
            <block>
              // Switch to DP Register Bank 0
              WriteDP(DP_SELECT, select);
              
              // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
              powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
            </block>
            <control if="powered_down">
              <block>
                // Request Debug/System Power-Up
                WriteDP(DP_CTRL_STAT, 0x50000000);
              </block>
              <!-- Wait for Power-Up Request to be acknowledged -->
              <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>
              <!-- JTAG Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 1">
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                  WriteDP(DP_CTRL_STAT, 0x50000F32);
                </block>
              </control>
              <!-- SWD Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 2">
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  WriteDP(DP_CTRL_STAT, 0x50000F00);
                  
                  // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                  WriteDP(SW_DP_ABORT, 0x0000001E);
                </block>
              </control>
            </control>
          </sequence>
          <sequence Pname="cm4" name="DebugPortStart">
            <block>
              __var reg;
              __var start;
              
              __ap = 0;
              Sequence("dpstart");
              
              // prepare trap code for CM4
              start = 0x20250000;
              WriteAP(0x4, start);
              WriteAP(0xC, start + 0x20);
              
              WriteAP(0x4, start + 4);
              WriteAP(0xC, 0x23F041);
              
              WriteAP(0x4, 0x40c0c000);
              WriteAP(0xC, start &amp; 0xFFFF);
              
              WriteAP(0x4, 0x40c0c004);
              WriteAP(0xC, (start &amp; 0xFFFF0000) &gt;&gt; 16);
              
              //release cm4
              WriteAP(0x4, 0x40c04000);
              WriteAP(0xC, 1);
              
              //change reset mode of cm4
              WriteAP(0x4, 0x40c04004);
              reg = ReadAP(0xC);
              reg |= (0x3 &lt;&lt; 10);
              WriteAP(0xC, reg);
              
