vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1166_DFP.pdsc
    <condition id="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MIMXRT1166xxxxx, device.RTE, device_id=MIMXRT1166xxxxx.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require condition="anyOf.allOf=driver.lpspi, device_id=MIMXRT1166xxxxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MIMXRT1166xxxxx.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpspi, device_id=MIMXRT1166xxxxx.internal_condition">
      <accept condition="allOf.driver.lpspi, device_id=MIMXRT1166xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi, device_id=MIMXRT1166xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.MIMXRT1166xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MIMXRT1166xxxxx, device.RTE, device_id=MIMXRT1166xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MIMXRT1166xxxxx, device.RTE, device_id=MIMXRT1166xxxxx.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpuart, device_id=MIMXRT1166xxxxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MIMXRT1166xxxxx.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpuart, device_id=MIMXRT1166xxxxx.internal_condition">
      <accept condition="allOf.driver.lpuart, device_id=MIMXRT1166xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart, device_id=MIMXRT1166xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.MIMXRT1166xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.codec.condition_id">
      <require condition="allOf.device=MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm4f, cm7f.condition_id">
      <require condition="cores.cm4f, cm7f.internal_condition"/>
    </condition>
    <condition id="cores.cm4f, cm7f.internal_condition">
      <accept Dcore="Cortex-M4"/>
      <accept Dcore="Cortex-M7"/>
    </condition>
    <condition id="driver.cs42448.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MIMXRT1166.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="driver.cs42888.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MIMXRT1166.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="driver.csi.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1166xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.dac12.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1166xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.dbi.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-common.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-dbi.condition_id">
      <require condition="allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MIMXRT1166.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require condition="device.MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-dsi-cmd.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT1166.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-mipi-dsi-cmd"/>
      <require condition="device.MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-elcdif.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.elcdif, device=MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.elcdif, device=MIMXRT1166.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="elcdif"/>
      <require condition="device.MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-lcdifv2.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.lcdifv2, device=MIMXRT1166.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.lcdifv2, device=MIMXRT1166.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lcdifv2"/>
      <require condition="device.MIMXRT1166.internal_condition"/>
    </condition>
