vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1166_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2dl_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2dl_usd.condition_id">
      <description>IW611-MURATA-2DL-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW611_BOARD_MURATA_2DL_USD
        #define WIFI_IW611_BOARD_MURATA_2DL_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2dl_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2ds_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2ds_m2.condition_id">
      <description>MURATA-2DS-M2 Wi-Fi board</description>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2ds_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2ds_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2ds_usd.condition_id">
      <description>MURATA-2DS-USD Wi-Fi board</description>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2ds_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2el_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2el_m2.condition_id">
      <description>IW612-MURATA-2EL-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW612_BOARD_MURATA_2EL_M2
        #define WIFI_IW612_BOARD_MURATA_2EL_M2
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2el_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2el_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2el_usd.condition_id">
      <description>IW612-MURATA-2EL-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW612_BOARD_MURATA_2EL_USD
        #define WIFI_IW612_BOARD_MURATA_2EL_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2el_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2ll_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2ll_m2.condition_id">
      <description>IW610-MURATA-2LL-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW610_BOARD_MURATA_2LL_M2
        #define WIFI_IW610_BOARD_MURATA_2LL_M2
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2ll_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2ll_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2ll_usd.condition_id">
      <description>IW610-MURATA-2LL-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW610_BOARD_MURATA_2LL_USD
        #define WIFI_IW610_BOARD_MURATA_2LL_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2ll_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_rd_rw61x" Cversion="1.0.0" condition="component.wifi_bt_module.board_rd_rw61x.condition_id">
      <description>RD-RW61X Wi-Fi board</description>
      <RTE_Components_h>
#ifndef WIFI_BOARD_RW610
#define WIFI_BOARD_RW610 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_rd_rw61x_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_jody_w2_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_jody_w2_usd.condition_id">
      <description>UBX-JODY-W2-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_88W8987_BOARD_UBX_JODY_W2_USD
        #define WIFI_88W8987_BOARD_UBX_JODY_W2_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_jody_w2_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_jody_w5_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_jody_w5_m2.condition_id">
      <description>UBX-JODY-W5-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_AW611_BOARD_UBX_JODY_W5_M2
        #define WIFI_AW611_BOARD_UBX_JODY_W5_M2
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_jody_w5_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_jody_w5_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_jody_w5_usd.condition_id">
      <description>UBX-JODY-W5-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_AW611_BOARD_UBX_JODY_W5_USD
        #define WIFI_AW611_BOARD_UBX_JODY_W5_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_jody_w5_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_lily_w1_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_lily_w1_usd.condition_id">
      <description>UBX-LILY-W1-USD Wi-Fi board</description>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_lily_w1_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_maya_w1_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_maya_w1_usd.condition_id">
      <description>UBX-MAYA-W1-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_UBX_MAYA_W1_USD
        #define WIFI_IW416_BOARD_UBX_MAYA_W1_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_maya_w1_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="bt_only_fw" Cversion="1.0.0" condition="component.wifi_bt_module.bt_only_fw.condition_id">
      <description>BT only firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_BT_ONLY_DNLD
        #define CONFIG_BT_ONLY_DNLD
        #endif
        #ifndef CONFIG_BT_IND_DNLD
        #define CONFIG_BT_IND_DNLD 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.bt_only_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config" Cversion="1.0.0" condition="component.wifi_bt_module.config.condition_id">
      <description>Wi-Fi and BT module configs</description>
      <files>
        <file category="header" name="components/wifi_bt_module/incl/wifi_bt_module_config.h" projectpath="component/wifi_bt_module/incl"/>
        <file category="include" name="components/wifi_bt_module/incl/"/>
      </files>
    </component>
