vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1166_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ili9341" Cversion="1.0.2" condition="driver.ili9341.condition_id">
      <description>Driver ili9341</description>
      <files>
        <file category="header" name="components/display/ili9341/fsl_ili9341.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/ili9341/fsl_ili9341.c" projectpath="lcdc"/>
        <file category="include" name="components/display/ili9341/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iomuxc" Cversion="2.0.0" condition="driver.iomuxc.condition_id">
      <description>IOMUXC Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_iomuxc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="key_manager" Cversion="2.0.2" condition="driver.key_manager.condition_id">
      <description>Key Manager Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_key_manager.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_key_manager.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="kpp" Cversion="2.1.0" condition="driver.kpp.condition_id">
      <description>KPP Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_kpp.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_kpp.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lcdifv2" Cversion="2.3.3" condition="driver.lcdifv2.condition_id">
      <description>LCDIFV2 Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_lcdifv2.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_lcdifv2.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpadc" Cversion="2.9.3" condition="driver.lpadc.condition_id">
      <description>LPADC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_lpadc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_lpadc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.6.2" condition="driver.lpi2c.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_lpi2c.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_lpi2c.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma" Cversion="2.4.4" condition="driver.lpi2c_edma.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_lpi2c_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_lpi2c_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi" Cversion="2.7.3" condition="driver.lpspi.condition_id">
      <description>LPSPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_lpspi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_lpspi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma" Cversion="2.4.9" condition="driver.lpspi_edma.condition_id">
      <description>LPSPI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_lpspi_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_lpspi_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart" Cversion="2.10.0" condition="driver.lpuart.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_lpuart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_lpuart.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma" Cversion="2.6.0" condition="driver.lpuart_edma.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_lpuart_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_lpuart_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lsm6dso" Cversion="1.0.0" condition="driver.lsm6dso.condition_id">
      <description>Driver lsm6dso</description>
      <files>
        <file category="header" name="components/sensor/lsm6dso/fsl_lsm.h" projectpath="tilt_pedo"/>
        <file category="sourceC" name="components/sensor/lsm6dso/fsl_lsm.c" projectpath="tilt_pedo"/>
        <file category="include" name="components/sensor/lsm6dso/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="max30101" Cversion="1.0.0" condition="driver.max30101.condition_id">
      <description>Driver max30101</description>
      <files>
        <file category="header" name="components/sensor/max30101/fsl_max.h" projectpath="heartrate"/>
        <file category="sourceC" name="components/sensor/max30101/fsl_max.c" projectpath="heartrate"/>
        <file category="include" name="components/sensor/max30101/"/>
      </files>
    </component>
