vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1166_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mecc" Cversion="2.1.1" condition="driver.mecc.condition_id">
      <description>MECC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_mecc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_mecc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="memory" Cversion="2.0.0" condition="driver.memory.condition_id">
      <description>MEMORY Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_memory.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mipi_csi2rx" Cversion="2.0.4" condition="driver.mipi_csi2rx.condition_id">
      <description>MIPI CSI2RX Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_mipi_csi2rx.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_mipi_csi2rx.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="soc_mipi_csi2rx" Cversion="2.0.2" condition="driver.mipi_csi2rx_soc.condition_id">
      <description>SOC MIPI CSI2RX Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_soc_mipi_csi2rx.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_soc_mipi_csi2rx.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="soc_mipi_dsi" Cversion="2.0.0" condition="driver.mipi_dsi_soc.condition_id">
      <description>SOC MIPI DSI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_soc_mipi_dsi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mipi_dsi_split" Cversion="2.3.0" condition="driver.mipi_dsi_split.condition_id">
      <description>MIPI DSI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_mipi_dsi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_mipi_dsi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8451q" Cversion="1.0.0" condition="driver.mma8451q.condition_id">
      <description>Driver mma8451q</description>
      <files>
        <file category="header" name="components/sensor/mma8451q/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8451q/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8451q/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8652fc" Cversion="1.0.0" condition="driver.mma8652fc.condition_id">
      <description>Driver mma8652fc</description>
      <files>
        <file category="header" name="components/sensor/mma8652fc/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8652fc/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8652fc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mu" Cversion="2.3.0" condition="driver.mu.condition_id">
      <description>MU Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_mu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_mu.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mx25r_flash" Cversion="2.0.0" condition="driver.mx25r_flash.condition_id">
      <description>Driver mx25r_flash</description>
      <files>
        <file category="header" name="components/mx25r_flash/mx25r_flash.h" projectpath="source"/>
        <file category="sourceC" name="components/mx25r_flash/mx25r_flash.c" projectpath="source"/>
        <file category="include" name="components/mx25r_flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nic301" Cversion="2.0.1" condition="driver.nic301.condition_id">
      <description>NIC301 Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_nic301.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nmh1000" Cversion="1.0.0" condition="driver.nmh1000.condition_id">
      <description>Driver nmh1000</description>
      <files>
        <file category="header" name="components/sensor/nmh1000/fsl_nmh1000.h" projectpath="nmh1000"/>
        <file category="sourceC" name="components/sensor/nmh1000/fsl_nmh1000.c" projectpath="nmh1000"/>
        <file category="include" name="components/sensor/nmh1000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ocotp" Cversion="2.1.4" condition="driver.ocotp.condition_id">
      <description>OCOTP Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1166/drivers/fsl_ocotp.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1166/drivers/fsl_ocotp.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1166/drivers/"/>
      </files>
    </component>
